def сортування_вибором(список, напрямок="зростання"):

    n = len(список)
    for i in range(n):

        індекс = i
        for j in range(i + 1, n):
            if (напрямок == "зростання" and список[j] < список[індекс]) or \
                    (напрямок == "спадання" and список[j] > список[індекс]):
                індекс = j

        список[i], список[індекс] = список[індекс], список[i]
    return список



список_1 = [64, 34, 25, 12, 22, 11, 90]
список_2 = [5, 8, 1, 3, 7, 9, 2]

print("Сортування за зростанням:")
print(сортування_вибором(список_1, "зростання"))
print(сортування_вибором(список_2, "зростання"))

print("\nСортування за спаданням:")
print(сортування_вибором(список_1, "спадання"))
print(сортування_вибором(список_2, "спадання"))
